// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const userNumber = Number(prompt("Введіть Ваше число"));

// if (isNaN(userNumber)) {
//   alert("Ви ввели не число!");
// } else if (userNumber === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// console.log(userNumber);

///////////////// ЗАВДАННЯ 2
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// if (min <= 14) {
//   alert(`${min} входить в першу чверть`);
// } else if (min <= 29) {
//   alert(`${min} входить в другу чверть`);
// } else if (min <= 44) {
//   alert(`${min} входить в третю чверть`);
// } else {
//   alert(`${min} входить в четверту чверть`);
// }

// console.log(min);

///////////////// ЗАВДАННЯ 3
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const userSeason = Number(prompt("Введіть число від 1 до 4 включно"));
// let result;

// switch (userSeason) {
//   case 1:
//     result = "Зима";
//     break;
//   case 2:
//     result = "Весна";
//     break;
//   case 3:
//     result = "Літо";
//     break;
//   case 4:
//     result = "Осінь";
//     break;
//   default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
//     break;
// }

// console.log(result);

// ///////////////////   ЗАВДАННЯ 4
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples
// padStart працює тільки зі стрінг !

// const userTimeNumber = prompt("Введіть число");
// const hours = String(Math.floor(userTimeNumber / 60)).padStart(2, "0");
// // рядок(де округляємо userTimeNumber до верху (та userTimeNumber ділитимемо на 60))
// // оскільки 1 год = 60хв. а padStart (довжина значень = 2, до якої додасться (стрінг 0))
// // тобто 60 === 01
// const minutes = String(userTimeNumber % 60).padStart(2, "0");
// // практично теж саме що і вище, але рядок із числом користувача не округлюємо,
// // а вже ділитимемо із залишком (% на 60) + із таким самим padStartом
// // тобто 125 = 02:05; 5 = 00:05; 25 = 00:25
// console.log(`${hours}:${minutes}`);

// /////// ЗАВДАННЯ 5
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера
// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// const userLogin = prompt("Введіть свій логін");
// console.log(userLogin);

// if (userLogin === "Адмін") {
//   const userPassword = prompt("Введіть пароль:");

//   if (userPassword === "Я головний") {
//     alert("Добрий день!");
//   } else {
//     alert("Невірний пароль!");
//   }
// } else if (!userLogin.trim()) {
//   /// якщо НЕлогін - не "Андмін" + забираємо пробіли, бо якщо поставити пробіл = "я вас не знаю"
//   alert("Скасовано");
// } else {
//   alert("Я вас не знаю");
// }

// ////// Завдання 6
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let a = 0;
// let b = 20;

// while (a <= b) {
//   console.log(a);
//   a++;
// }

// //////// ЗАВДАННЯ 7
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//   let evenOdd = 0;

//   for (let i = max; i >= min; i--) {
//     console.log(i);

//     if (i % 2 === 0) {
//       evenOdd += i;
//     }
//   }

//   return evenOdd;
// }

// const res = getNumbers(0, 10);
// console.log("Сума парних чисел:", res);

// ///////// ЗАВДАННЯ 8
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// function getMin(a, b) {
//   if (isNaN(a) || isNaN(b)) {
//     return "Not a number!";
//   }
//   return Math.min(a, b);
// }

// console.log(getMin(1, 2)); // 1
// console.log(getMin(10, 5)); // 5
// console.log(getMin("5", "10")); // 5 (рядки з числами — працює)
// console.log(getMin("s5", "sds")); // "Not a number!"
// console.log(getMin("3a", 2)); // "Not a number!"

// ////// ЗАВДАННЯ 9
// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   } else {
//     return confirm("Вам точно є 18 років?");
//   }
// }

// console.log(isAdult(18));
// console.log(isAdult(15));

// /////// ЗАВДАННЯ 10
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число
// від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// function fizzBuzz(num) {
//   for (let i = 1; i <= num; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log("fizzbuzz");
//     } else if (i % 3 === 0) {
//       console.log("fizz");
//     } else if (i % 5 === 0) {
//       console.log("buzz");
//     } else {
//       console.log(i);
//     }
//   }
// }

// let num = 20;
// fizzBuzz(num);
